Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлюдоГотово</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/Заказы/Ext/Module.bsl
Функция ЗакрытьЗаказ(НомерЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерЗаказа);
	РезультатЗапроса = Запрос.Выполнить();        
	Выборка = РезультатЗапроса.Выбрать();
	Ответ = ПолучитьОбъектXDTO("Ответ");
	
	Если Выборка.Количество() = 0 Тогда
		
		Ответ.Текст = "Документа с номером ( " + НомерЗаказа + " ) не существует";
		ТекстXML = ПолучитьТекстXML(Ответ);
		Возврат ТекстXML;
	
	КонецЕсли;                          
	
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Ссылка;
		
	КонецЦикла;
	
	ОбъектЗаказ = Ссылка.ПолучитьОбъект();
	
	Если ОбъектЗаказ.ПометкаУдаления = Истина Тогда
		
		Ответ.Текст = "У документа ( " + НомерЗаказа + " ) есть пометка на удаление";		
	
	ИначеЕсли ОбъектЗаказ.СтатусЗаказа <> Перечисления.СтатусыЗаказов.Готов Тогда
		
		ОбъектЗаказ.СтатусЗаказа = Перечисления.СтатусыЗаказов.Готов;
		ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		Ответ.Текст = "Успешно";
		
	Иначе
		
		Ответ.Текст = "У документа ( " + НомерЗаказа + " ) уже статус ( Готов )";

	КонецЕсли;
		
	ТекстXML = ПолучитьТекстXML(Ответ);
	Возврат ТекстXML;		
	
КонецФункции

Функция ПолучитьТекстXML(Ответ)
	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
	ТекстXML = ЗаписьXML.Закрыть();
	Возврат ТекстXML;

КонецФункции

Функция ПолучитьОбъектXDTO(НаименованиеОбъекта)
		
	Тип = ФабрикаXDTO.Тип("http://localhost/shawarman2", НаименованиеОбъекта);
	Возврат ФабрикаXDTO.Создать(Тип);   
	
КонецФункции
